In [1]:
print(2+3)

5

In [59]:
# Sample dataframe to be used in most of the functions below.
import pandas as pd
# assign data of lists.
data =  {'Name': ['Tom', 'Joseph', 'Krish', 'John','Linn'], 'Age': [20, 21, 19, 18,20],'StudentID':[1,2,3,4,5],'Topic_1_E1_C1':['DigestiveSystem','Botany','Cell Bilology','Cell-Physiology','Nervous-System'],'Topic_E1_C1':['Italy','Germany','France','Sweden','Poland']}
# Create DataFrame.
testdf = pd.DataFrame(data)
# Print the output.
print(testdf)

     Name  Age  StudentID    Topic_1_E1_C1 Topic_E1_C1
0     Tom   20          1  DigestiveSystem       Italy
1  Joseph   21          2           Botany     Germany
2   Krish   19          3    Cell Bilology      France
3    John   18          4  Cell-Physiology      Sweden
4    Linn   20          5   Nervous-System      Poland

Function or order(arrange columns) in a particular Order from Left.

In [60]:
# Function to order column in a particular order
#Very Handy to get unique columns in the begining, esp in case of Wide Dataset.
# REF : https://stackoverflow.com/questions/13148429/how-to-change-the-order-of-dataframe-columns
def order(frame,var):
    if type(var) is str:
        var = [var] #let the command take a string or list
    varlist =[w for w in frame.columns if w not in var]
    frame = frame[var+varlist]
    return frame

In [61]:
testdf = order(testdf,['StudentID','Name'])
print(testdf)

   StudentID    Name  Age    Topic_1_E1_C1 Topic_E1_C1
0          1     Tom   20  DigestiveSystem       Italy
1          2  Joseph   21           Botany     Germany
2          3   Krish   19    Cell Bilology      France
3          4    John   18  Cell-Physiology      Sweden
4          5    Linn   20   Nervous-System      Poland

Function to create a CSV files from a dataframe based on Chunk Size
especially useful to create file for upload in another system where their is restrictions 
in the nos of records or file Sizes etc.

In [62]:
from more_itertools import sliced
import csv

def createCSVsforImport(chunk_size, OutputLocation,dataframeInput):    
    index_slices = sliced(range(len(dataframeInput)), chunk_size)    
    i=0
    for index_slice in index_slices:
        chunk = dataframeInput.iloc[index_slice] # your dataframe chunk ready for use
        chunk.to_csv(OutputLocation+'CSVFile_{id}.csv'.format(id = i), sep='|', encoding='utf-8-sig',index=False, line_terminator='\n' , escapechar='\\', quoting=csv.QUOTE_ALL,chunksize=50)#,quoting=csv.QUOTE_NONE, escapechar='\\')
        i = i+1

In [63]:
createCSVsforImport(2, "D:\\GITCODE\\Outputs\\",testdf)

In [64]:
### TO show the image of the output generated by the function above.
# import image module
from IPython.display import Image
  
# get the image
Image(url="1_CSVOutputs.jpg")

Code / Function to rename similar columns and combine/concatenate many columns into 1 , seperated by comma

In [68]:
df_concat = testdf.copy()
df_concat.head()

   StudentID    Name  Age    Topic_1_E1_C1 Topic_E1_C1
0          1     Tom   20  DigestiveSystem       Italy
1          2  Joseph   21           Botany     Germany
2          3   Krish   19    Cell Bilology      France
3          4    John   18  Cell-Physiology      Sweden
4          5    Linn   20   Nervous-System      Poland

In [69]:
# remove suffix
df_concat.columns = df_concat.columns.str.rstrip("_E1_C1")
df_concat.head()

   StudentID    Name  Age            Topic    Topic
0          1     Tom   20  DigestiveSystem    Italy
1          2  Joseph   21           Botany  Germany
2          3   Krish   19    Cell Bilology   France
3          4    John   18  Cell-Physiology   Sweden
4          5    Linn   20   Nervous-System   Poland

In [70]:
#combine-duplicate-columns-into-one
# REF : https://stackoverflow.com/questions/37932391/pandas-dataframe-combine-duplicate-columns-into-one-separate-data-by-comma
def cobinecols(y):
        return ','.join(y[y.notnull()].astype(str))
dfCombine = df_concat.groupby(level=0, axis=1).apply(lambda y: y.apply(cobinecols, axis=1))
dfCombine.head()

  Age    Name StudentID                   Topic
0  20     Tom         1   DigestiveSystem,Italy
1  21  Joseph         2          Botany,Germany
2  19   Krish         3    Cell Bilology,France
3  18    John         4  Cell-Physiology,Sweden
4  20    Linn         5   Nervous-System,Poland